## Encoding Begins From Here

In [70]:
# Importing the liibraries

import pandas as pd


sfile = pd.read_csv("Salary_Data.csv")
sfile.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [71]:
# Checking the null values

sfile.isnull().sum()

Age                    2
Gender                 2
Education Level        3
Job Title              2
Years of Experience    3
Salary                 5
dtype: int64

In [72]:
# Removing the null values

sfilena = sfile.dropna()

In [73]:
sfilena.isnull().sum()

Age                    0
Gender                 0
Education Level        0
Job Title              0
Years of Experience    0
Salary                 0
dtype: int64

In [74]:
# Checking the columns values

sfilena.columns

Index(['Age', 'Gender', 'Education Level', 'Job Title', 'Years of Experience',
       'Salary'],
      dtype='object')

In [75]:
# Replacing the written letter of education level and years of experience

sfilere = sfilena.rename(columns = {
    "Education Level":"Education",
    "Years of Experience":"Experience"
})

In [76]:
sfilere.head()

    Age  Gender   Education          Job Title  Experience    Salary
0  32.0    Male  Bachelor's  Software Engineer         5.0   90000.0
1  28.0  Female    Master's       Data Analyst         3.0   65000.0
2  45.0    Male         PhD     Senior Manager        15.0  150000.0
3  36.0  Female  Bachelor's    Sales Associate         7.0   60000.0
4  52.0    Male    Master's           Director        20.0  200000.0

In [77]:
# Mainting the consistency where there is no consistent variables

sfilere['Education']


sfilere['Education'].unique()

array(["Bachelor's", "Master's", 'PhD', "Bachelor's Degree",
       "Master's Degree", 'High School', 'phD'], dtype=object)

In [78]:
# Renaming

sfilere['Education'] = sfilere['Education'].replace({
    "Bachelor's Degree": "Bachelors",
    "Master's Degree": "Masters",
    "Bachelor's": "Bachelors",
    "Master's": "Masters",
    "phD": "PhD"
})

In [79]:
sfilere['Education'].unique()

array(['Bachelors', 'Masters', 'PhD', 'High School'], dtype=object)

In [80]:
# Ordinal Values are now mapped or replaced as

sfilere['Education'] = sfilere['Education'].map({
    'High School': 0,
    'Bachelors': 1,
    'Masters': 2,
    'PhD': 4
})

In [81]:
sfilere.head()

    Age  Gender  Education          Job Title  Experience    Salary
0  32.0    Male          1  Software Engineer         5.0   90000.0
1  28.0  Female          2       Data Analyst         3.0   65000.0
2  45.0    Male          4     Senior Manager        15.0  150000.0
3  36.0  Female          1    Sales Associate         7.0   60000.0
4  52.0    Male          2           Director        20.0  200000.0

In [82]:
# NOw we move on to Gender Values since it has nominal values

# We use pd.get_dummies function to have this  thing working

import pandas as pd

sfilere['Gender'].unique()

array(['Male', 'Female', 'Other'], dtype=object)

### One hot Encoding Begins From Here

In [83]:
df = pd.get_dummies(sfilere['Gender'], dtype=int)
df.head()

   Female  Male  Other
0       0     1      0
1       1     0      0
2       0     1      0
3       1     0      0
4       0     1      0

In [84]:
# Converting the data into numpy arrays

import numpy as np

dfnp = np.array([[40,0,0]])

dfnp = np.array([[40,1,0]])

In [85]:
# SPlitting the features
sfilere.columns

Index(['Age', 'Gender', 'Education', 'Job Title', 'Experience', 'Salary'], dtype='object')

In [94]:
# Splitting the feautes
x =sfilere[['Age', 'Education', 'Experience']]
y =sfilere.Salary

In [95]:
x.head()

    Age  Education  Experience
0  32.0          1         5.0
1  28.0          2         3.0
2  45.0          4        15.0
3  36.0          1         7.0
4  52.0          2        20.0

In [96]:
y.head()

0     90000.0
1     65000.0
2    150000.0
3     60000.0
4    200000.0
Name: Salary, dtype: float64

### Target Encoding Begins Here

In [91]:
sfilere['Job Title'].nunique()

191

In [92]:
sfilere['Job Title'].unique()

array(['Software Engineer', 'Data Analyst', 'Senior Manager',
       'Sales Associate', 'Director', 'Marketing Analyst',
       'Product Manager', 'Sales Manager', 'Marketing Coordinator',
       'Senior Scientist', 'Software Developer', 'HR Manager',
       'Financial Analyst', 'Project Manager', 'Customer Service Rep',
       'Operations Manager', 'Marketing Manager', 'Senior Engineer',
       'Data Entry Clerk', 'Sales Director', 'Business Analyst',
       'VP of Operations', 'IT Support', 'Recruiter', 'Financial Manager',
       'Social Media Specialist', 'Software Manager', 'Junior Developer',
       'Senior Consultant', 'Product Designer', 'CEO', 'Accountant',
       'Data Scientist', 'Marketing Specialist', 'Technical Writer',
       'HR Generalist', 'Project Engineer', 'Customer Success Rep',
       'Sales Executive', 'UX Designer', 'Operations Director',
       'Network Engineer', 'Administrative Assistant',
       'Strategy Consultant', 'Copywriter', 'Account Manager',
       'Director of Marketing', 'Help Desk Analyst',
       'Customer Service Manager', 'Business Intelligence Analyst',
       'Event Coordinator', 'VP of Finance', 'Graphic Designer',
       'UX Researcher', 'Social Media Manager', 'Director of Operations',
       'Senior Data Scientist', 'Junior Accountant',
       'Digital Marketing Manager', 'IT Manager',
       'Customer Service Representative', 'Business Development Manager',
       'Senior Financial Analyst', 'Web Developer', 'Research Director',
       'Technical Support Specialist', 'Creative Director',
       'Senior Software Engineer', 'Human Resources Director',
       'Content Marketing Manager', 'Technical Recruiter',
       'Sales Representative', 'Chief Technology Officer',
       'Junior Designer', 'Financial Advisor', 'Junior Account Manager',
       'Senior Project Manager', 'Principal Scientist',
       'Supply Chain Manager', 'Senior Marketing Manager',
       'Training Specialist', 'Research Scientist',
       'Junior Software Developer', 'Public Relations Manager',
       'Operations Analyst', 'Product Marketing Manager',
       'Senior HR Manager', 'Junior Web Developer',
       'Senior Project Coordinator', 'Chief Data Officer',
       'Digital Content Producer', 'IT Support Specialist',
       'Senior Marketing Analyst', 'Customer Success Manager',
       'Senior Graphic Designer', 'Software Project Manager',
       'Supply Chain Analyst', 'Senior Business Analyst',
       'Junior Marketing Analyst', 'Office Manager', 'Principal Engineer',
       'Junior HR Generalist', 'Senior Product Manager',
       'Junior Operations Analyst', 'Senior HR Generalist',
       'Sales Operations Manager', 'Senior Software Developer',
       'Junior Web Designer', 'Senior Training Specialist',
       'Senior Research Scientist', 'Junior Sales Representative',
       'Junior Marketing Manager', 'Junior Data Analyst',
       'Senior Product Marketing Manager', 'Junior Business Analyst',
       'Senior Sales Manager', 'Junior Marketing Specialist',
       'Junior Project Manager', 'Senior Accountant', 'Director of Sales',
       'Junior Recruiter', 'Senior Business Development Manager',
       'Senior Product Designer', 'Junior Customer Support Specialist',
       'Senior IT Support Specialist', 'Junior Financial Analyst',
       'Senior Operations Manager', 'Director of Human Resources',
       'Junior Software Engineer', 'Senior Sales Representative',
       'Director of Product Management', 'Junior Copywriter',
       'Senior Marketing Coordinator', 'Senior Human Resources Manager',
       'Junior Business Development Associate', 'Senior Account Manager',
       'Senior Researcher', 'Junior HR Coordinator',
       'Director of Finance', 'Junior Marketing Coordinator',
       'Junior Data Scientist', 'Senior Operations Analyst',
       'Senior Human Resources Coordinator', 'Senior UX Designer',
       'Junior Product Manager', 'Senior Marketing Specialist',
       'Senior IT Project Manager', 'Senior Quality Assurance Analyst',
       'Director of Sales and Marketing', 'Senior Account Executive',
       'Director of Business Development', 'Junior Social Media Manager',
       'Senior Human Resources Specialist', 'Senior Data Analyst',
       'Director of Human Capital', 'Junior Advertising Coordinator',
       'Junior UX Designer', 'Senior Marketing Director',
       'Senior IT Consultant', 'Senior Financial Advisor',
       'Junior Business Operations Analyst',
       'Junior Social Media Specialist',
       'Senior Product Development Manager', 'Junior Operations Manager',
       'Senior Software Architect', 'Junior Research Scientist',
       'Senior Financial Manager', 'Senior HR Specialist',
       'Senior Data Engineer', 'Junior Operations Coordinator',
       'Director of HR', 'Senior Operations Coordinator',
       'Junior Financial Advisor', 'Director of Engineering',
       'Software Engineer Manager', 'Back end Developer',
       'Senior Project Engineer', 'Full Stack Engineer',
       'Front end Developer', 'Front End Developer',
       'Director of Data Science', 'Human Resources Coordinator',
       'Junior Sales Associate', 'Human Resources Manager',
       'Juniour HR Generalist', 'Juniour HR Coordinator',
       'Digital Marketing Specialist', 'Receptionist',
       'Marketing Director', 'Social Media Man', 'Delivery Driver'],
      dtype=object)